package messages

const (
	HELP_MESSAGE = "راهنمای استفاده از ربات\n\n" +
		"1️⃣ برای شروع یک حراجی جدید از دستور /start استفاده کنید.\n" +
		"این دستور به سه ورودی نام حراجی (شامل حروف و ارقام)، نمره اولیه (float) و حداقل اختلاف پیشنهاد (float) احتیاج دارد. مثال:\n" +
		"/start hw1 3.0 0.05\n\n" +
		"2️⃣ برای شرکت در حراجی فعال از دستور /bid استفاده کنید.\n" +
		"این دستور دو ورودی نام حراجی و مبلغ پیشنهادی اجتیاج دارد. مثال:\n" +
		"/bid hw1 2.5"

	START_AUCTION_MESSAGE = " حراجی جدید %s شروع شد.\n\n" +
		"نمره اولیه حراجی: %.2f\n" +
		"حداقل اختلاف میان دو پیشنهاد: %.2f\n\n" +
		"برای شرکت در حراجی از دستور /bid استفاده کنید.\n"

	COUNTDOWN_THREE_MESSAGE = "%.2f نمره برای این سوال 3️⃣\n" +
		"بشتابید و نمره کمتری پیشنهاد دهید."

	COUNTDOWN_TWO_MESSAGE = "%.2f نمره برای این سوال 2️⃣\n" +
		"کسی نمی‌خواهد پیشنهاد کمتری دهد؟"

	COUNTDOWN_ONE_MESSAGE = "%.2f نمره برای این سوال 1️⃣\n" +
		"آخرین فرصت برای پیشهاد کمتر رو از دست نده!"

	NO_ACTIVE_AUCTION_MESSAGE = "هیچ حراجی فعالی وجود ندارد."

	NO_AUCTION_MESSAGE = "حراجی با این نام وجود ندارد."

	INVALID_CHAT_ID_MESSAGE = "اینجا جای مناسبی برای پیشنهاد دادن به این حراجی نیست!"

	INVALID_BID_MESSAGE = "پیشنهاد نامعتبر است. پیشنهاد خود را با فرمت درست ارسال کنید."

	INVALID_BID_AMOUNT_MESSAGE = "همین الانش پیشنهاد %.2f داریم! پیشنهادت باید کمتر از %.2f باشه!"

	ACCEPTED_BID_MESSAGE = "پیشنهاد %s با نمره %.2f با موفقیت پذیرفته شد! فعلا شما برنده این حراجی هستید."

	END_AUCTION_MESSAGE = "حراجی %s به پایان رسید. 🔨\n" +
		"این سوال زیبا به %s با نمره %.2f داده شد. به ایشان تبریک می‌گوییم."

	NOT_ADMIN_MESSAGE = "🚫 متاسفانه امکان اینکه شما حراجی را آغاز کنید وجود ندارد."

	ACTIVE_AUCTION_EXISTS_MESSAGE = "‼️ اول اجازه بده حراجی قبلی به پایان برسه!"

	INVALID_START_MESSAGE = "❗️ فرمت شروع یک حراجی را درست وارد کنید. با استفاده از /help می‌توانید فرمت صحیح را پیدا کنید."
)
